export interface AlbumDocument {
  title: string;
  content: string[];
}

// Content parsed from 飞出重山的断肠诗——《为何飞来》创作记.docx
export const creativeProcess: AlbumDocument = {
  title: "飞出重山的断肠诗——《为何飞来》创作记",
  content: [
    "我是青木乐队的主唱辰，我们的首张专辑已经发布了，现在想把这些创作的过程都记录下来。既是作为创作者、亲历者，也有在自己收听作品后作为旁观者的一部分。",

    "现在，我们开始飞行吧。",

    "这张专辑的全由少年心气而生。从大概22年开始，自己就很想有做一些歌曲的冲动，那也正是我本科毕业去更远的地方上研究生的节点，一切都在变化，学校在变、城市在变、作息在变，思维方式和行为习惯也在开始变化 。那种感觉像是初学游泳的时候，被这世界突然扔进了水池里一样，毫无防备但必须接受，用不同的方式挣扎着将头探出水面。我想趁着短暂探出的那些时刻大口地呼吸，而那时能给予我慰藉的只有音乐。",

    "于是我把自己埋进耳机里，在实验室不分昼夜调光路的时刻，在每天凌晨往返在宿舍的电动车上，在那些被封闭的校区里，我一遍又一遍地听着白鸽和遥望，只有它们能一直陪着我。我想起更早的本科的时候，也是白鸽陪着我，那天下午得到了一个期待很久付出很多终于得到回报的好消息，于是从学校图书馆狂奔而出，开着电动车在偌大的校园里高呼着白鸽的旋律，觉得自己在风中飞行，那是个武汉夏天的下午，虽然太阳隐在云里，空气散着蝉鸣和潮湿，可我却觉得凉爽和格外的洒脱，仿佛自己拥有无尽的自由和未来。",

    "时间就这么过，到了23年来到上海，火车越来越远，我真正地飞出了重山，很多东西却再也回不去。这像是一种心理上的转变，可能是因为这一年我才刚满22岁，也是传统意义上大学毕业的时间，早读了一年书，很多情感涌来的时刻，都比真正经历时要晚一些，已经发生很久了我才真正地有刻骨铭心的感觉，我知道那些东西我再也无法拥有了，无论我怎么歌唱、怎么在深夜里妄图抓回来，时间就是单向的，我不再是那个无忧虑的少年，风也不再轻松。",

    "就在那些懵懂迷茫破碎的时刻里，忽地一天早晨我看见我的窗台上赫然躺着一只死雀。青羽白翅，手掌大小，就静静躺在那里，带着些许难以察觉的血迹。默然。那一刻，是山崩。它从哪里来？要到哪里去？为什么飞到我的窗前而死？",

    "有一个念头在我心里发芽了，我默默将它放回到土里，想着一定一定要做些什么，至少写些什么，以自己的方式，无论是纪念它，或是纪念我自己。为何飞来？这就是一些往事。接下来是我们飞行的故事了。",
  ],
};

// Content parsed from 渡越关山 为何飞来.docx
export const releaseNote: AlbumDocument = {
  title: "渡越关山 为何飞来",
  content: [
    "这张专辑做完了，像是一场漫长的旅程画上了句号。",

    "有些情绪一直萦绕在心底，每次想落笔写些什么纪念那些时刻的时候，它们会一遍又一遍地被翻起，本以为我不会再有涟漪。",

    "真正临到了这个时刻，我却什么话都说不出来了。我看着眼前的屏幕上的轨道发呆，窗外的枯木伴着高树，青羽白翅的飞鸟划过灰色的天空，雨淅淅沥沥地飘着，像小雪粒一样飘在空中，闻着被翻出的泥土的味道，那些戴着安全帽的工人在脚手架上攀爬，在钢筋之间穿梭。而我呢，我清楚的知道这是我青春的尾巴，怀念的怨恨的不舍的咒骂的一切终将逝去，一切的一切都会在时间里被冲刷，若干年后那些情绪那些时刻不会有人再记起，权且留下这些声音在这天地间，任由它回响在这大大世界，飘到不知何处的小角落里。",

    "还是很想多说一点话，这些时刻在人生里谁又知道能有几回呢。我的耳机里一遍又一遍的放着那些旋律，毫无疑问地，我期待它们面世的那一刻，可一旦它们面世，这些旋律这些声音也当然不止属于我们了，这是一种很奇特的感觉，不知道自己剖肝沥胆做出来的东西会不会真的有人能喜欢，但转念一想，这些时刻已经被我好好地记录下来了，十年之后二十年之后再听再看，我也无怨无悔，就如那只青雀。",

    "相聚在一起是难以乞求的事情，感谢这一路乐队所有成员的陪伴和付出，我回想起很久以前临近本科毕业的夜晚在华科的草坪上，我和肖忠培伴着吉他和手电筒唱着送别，还有过去很多次的相聚或是争执，以及下定决心要做自己音乐的那个夜晚，一切竟然真的就这么做出来了，两个懵懂的来自南方的少年一路总算走到了这里。还有属于我们乐队一起的那些的时刻，跟老邓的相遇、昕蕾和老卫的加入，酷暑里辗转大半个城市后，在阁楼或地下室的声音里，我们的身边就是彼此。",

    "春天的风慢慢吹过来了，带着我们的回响。",

    "诚惶诚恐，顿首再拜。",
  ],
};
