export const lyrics: Record<string, string | null> = {
  "xu-chao-qi": null,

  "ting-chao": `平生不修善果，
只爱杀人放火，
忽地顿开金绳，
这里扯断玉锁
逢夏而擒，
遇腊而执。
听潮而圆，
见信而寂

钱塘江上潮信来，今日方知我是我
钱塘江上潮信来，今日方知我是我
钱塘江上潮信来，今日方知我是我
钱塘江上潮信来，今日方知……`,

  "yu-gong-ji-shan": `冀州之南 河阳之北
愚公握着长长的斧头 不停地挥
白色的胡须扎在他满是沟壑的脸上
那是岁月碾过 风霜刮过 时间的叹息
是烈日凌空 或暴雨骤风
愚公的斧头 从不曾放松
心底的勇气 石头会碎裂
山峰会磨平 子孙会延续
一切会延续
哦他想
一切会延续
他想
子孙会延续
哦 子子孙孙无穷尽也
子子孙孙无穷尽
子子孙孙无穷尽也
子子孙孙无穷尽
谷底的杂草 不断蔓延
山巅的猎鹰 依旧盘旋
愚公的斧头 指向苍天
一切却仍未改变
从未改变
从未改变
从未改变
从未改变

你想靠自己还是靠神仙

山影如铁 压住他的脊梁
黄土深处 埋着谁的希望
斧刃已经劈裂了手掌
他的眼睛 依然望向远方
远方的风
吹过荒原
远方的雷
滚过山巅
远方的火
烧尽黑夜
敢问远方的路
究竟通向哪边
山再巍峨 有崩塌的时候
人再渺小 总能击碎石头
可山外的山 仍然是山
那天外的天 依旧是天
子子孙孙无穷尽也
子子孙孙无穷尽
子子孙孙无穷尽也
子子孙孙无穷尽`,

  "lao-bo": `我的大伯 就住在澧水河边
他每天都戴着草帽 耳后别着两根香烟
不高的山丘 圈住他的田园
他每天忙完就靠着矮凳 静静望着天边
他说今年田里的土干得冒烟
将就一过又是一年
想着明年儿子又要结婚
说罢空中飘散烟圈
他说怨他当年没多念书
十六岁那年就辍了学
以后上过工地也下过田
四十年呐  就在一晃眼
守候着 守望着 生命里几多春秋
可歌啊 可叹啊 还剩下多少年头

我的大伯 摇晃在大巴车上
他双手紧攥行李 脑袋靠着车窗
坑坑洼洼布满泥水的路 伴他一直晃到县城
他到了还要转车 车牌箭头上写着深圳
他庆幸还好自己没满六十
不然得托关系才能去工地
他扛着蛇皮袋子一路往前
在道路尽头  悄悄回首

你说你过年就回来
你说你还要和我喝牛栏山
你说你过年就回来
得让我哥能娶上媳妇
你说你过年就回来
看看你养的猪和牛
你说你过年就回来
再回来陪陪大娘
你说你过年就回来
你也不想在外面奔波

那是潮湿的板房 挤下所有的工友
盒饭里只有米饭和土豆
你想家了只能一口一口吞酒
看着布满蛛丝的窗外 窗外只有一半的月球

守候着 守望着 生命里几多春秋
可歌啊 可叹啊 还剩下多少年头
守候着 守望着 生命里几多春秋
此生啊 梦醒了 没剩下多少年头`,

  "ji-ying": `季鹰归未？
季鹰归未？
季鹰安归？
季鹰归未？
季鹰归未？
季鹰安归？

天高云远
望断几只孤雁
风追雨赶
数过了几重重山
夜空夜风
拥过我肩头
想那些黄土和山丘
自此再不见春秋

季鹰归未？
季鹰归未？
季鹰安归？
季鹰归未？
季鹰归未？
季鹰安归？

千万重山水 纵横在我心
千万个梦里 呼唤我乳名
千万次回首 不见我身影
千万次回首 不见我身影

你们是弯弯的月亮
洁白的月亮
那天边的月亮
最遥远的月亮
待我归来时
只剩如血的残阳
只剩如血的残阳
只剩如血的残阳

季鹰归未？
季鹰归未？
季鹰安归？
季鹰归未？
季鹰归未？
季鹰安归？`,

  "gu-ming": null,

  "qing-que-zhong": `你生在雨中
潮湿的晨光里
唯有稀疏的羽毛
与稚嫩的眼光
蹒跚在树梢
母亲教你眺望远方
直到有天你学会飞翔
跌跌撞撞 满怀希望
青雀为何飞来在这窗台上
为何飞来在这窗台上
为何飞来
为何飞来
为何飞来

会否怀念那些饮着露水的早晨
与身披霞光的黄昏
你飞在雨中
零散的日暮里
唯有稀疏的羽毛
与眷恋的眼光
盘旋在树梢
不再眺望远方
终于有天你结束飞翔
跌跌撞撞 满怀希望
青雀为何飞来在这窗台上
为何飞来在这窗台上
跌跌撞撞 充斥着幻想
青雀为何飞来在这窗台上
为何撞死在这台阶上`,

  "mu-tou": `一棵木头
一棵扎在土里的木头
没有树叶的木头
做梦着向往着更高的宇宙
我是一颗木头
我不能够 停止漂流
剖开我的 是锋利的斧头
你能否看见我的 流血的伤口

可我不能说
也不能泪流
可我不能说
也无法渴求
可我不能说
再没有回头
可我不能说

一颗木头
一颗飘在水上的木头
没有生命的木头
广阔的天地间 一只蜉蝣
我是一颗木头
捂住我的 清澈的眼眸
撕开我的 流血的伤口
再剖开我的 喑哑的咽喉

我再不能说
也不能泪流
我再不能说
也无法渴求
我再不能说
再没有自由
我再不能说

啦……啦……啦……`,

  "zhong": `秒针旋转 身体在腐烂
是现实或虚幻 思想在混乱
时针缓慢 身体在习惯
可昼夜不断循环 思想在消散
谁能将我解救挣脱出这循环
钟声咆哮 无力呼叫
钟声萦绕 无处逃跑
哦我 围地自圈
哦我 恐惧时间
哦我 顾影自怜
哦我 逃避时间
时间 在空白
时间 在腐坏
时间 在徘徊
时间 在醒来

可是我啊
我也想存在
我也想多彩
我也想得到所有爱
哦神啊
如果你存在
当我再醒来
能不能让一切都停止在
这一刻
这一秒
这一瞬

我要醒来
秒针 停转 身体 在不安
这昼夜不再循环 而我渴望温暖
哦时间`,

  "chen-wu": `白雾茫茫
白雾茫茫
白雾茫茫
白雾茫茫

那些晦暗的意象 埋在我蓝色的眼眶
灰色的太阳漂在天空上  我看见水泥在飞扬
水泥在飞扬
是谁在无助张望
是谁在无助张望
是谁
是谁

旅程多漫长
旅程多漫长
旅程多漫长
旅程多漫长

就跑吧
就走吧
就走吧
就踏足新的土地
直到恐惧
淹没勇气
就踏足新的土地
直到肉体插满荆棘
就踏足新的土地
直到恐惧淹没勇气
直到肉体插满荆棘

太阳就在雾里
太阳就在雾里
我们都迷失在雾里
我们都迷失在雾里
就踏足新的土地
直到恐惧淹没勇气
直到肉体插满荆棘
太阳就在雾里
太阳就在雾里
我们都迷失在雾里
我们都相聚在雾里……`,
};
